In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
parser = lambda x: pd.datetime.strptime(x, "%Y, %m, $d, %M, %S")

jan_sales = pd.read_csv("../amazon_sales/Sales_January_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
feb_sales = pd.read_csv("../amazon_sales/Sales_February_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
mar_sales = pd.read_csv("../amazon_sales/Sales_March_2019.csv",parse_dates = ["Order Date"], date_parser = parser)
apr_sales = pd.read_csv("../amazon_sales/Sales_April_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
may_sales = pd.read_csv("../amazon_sales/Sales_May_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
jun_sales = pd.read_csv("../amazon_sales/Sales_June_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
jul_sales = pd.read_csv("../amazon_sales/Sales_July_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
aug_sales = pd.read_csv("../amazon_sales/Sales_August_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
sep_sales = pd.read_csv("../amazon_sales/Sales_September_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
oct_sales = pd.read_csv("../amazon_sales/Sales_October_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
nov_sales = pd.read_csv("../amazon_sales/Sales_November_2019.csv", parse_dates = ["Order Date"], date_parser = parser)
dec_sales = pd.read_csv("../amazon_sales/Sales_December_2019.csv", parse_dates = ["Order Date"], date_parser = parser)

In [3]:
jan_sales.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [4]:
year_sales = pd.concat([jan_sales, feb_sales, mar_sales, apr_sales, may_sales, jun_sales, jul_sales, 
                        aug_sales, sep_sales, oct_sales, nov_sales, dec_sales])

In [5]:
year_sales.shape[0]

186850

In [6]:
year_sales.describe().T

                   count  unique                   top    freq
Order ID          186305  178438              Order ID     355
Product           186305      20  USB-C Charging Cable   21903
Quantity Ordered  186305      10                     1  168552
Price Each        186305      24                 11.95   21903
Order Date        186850  142397                   nan     545
Purchase Address  186305  140788      Purchase Address     355

In [7]:
year_sales.drop_duplicates(subset = ["Order ID"], keep = 'first', inplace = True)
year_sales.shape[0]

178439

In [22]:
#year["year_sales"] = year_sales.to_datetime(year_sales["year_sales"], format = '%d%b%Y')

AttributeError: 'DataFrame' object has no attribute 'to_datetime'

In [8]:
year_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 178439 entries, 0 to 25116
Data columns (total 6 columns):
Order ID            178438 non-null object
Product             178438 non-null object
Quantity Ordered    178438 non-null object
Price Each          178438 non-null object
Order Date          178439 non-null object
Purchase Address    178438 non-null object
dtypes: object(6)
memory usage: 9.5+ MB

In [9]:
year_sales.isnull().sum()

Order ID            1
Product             1
Quantity Ordered    1
Price Each          1
Order Date          0
Purchase Address    1
dtype: int64

In [10]:
year_sales.dropna(inplace = True)

In [11]:
year_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 178438 entries, 0 to 25116
Data columns (total 6 columns):
Order ID            178438 non-null object
Product             178438 non-null object
Quantity Ordered    178438 non-null object
Price Each          178438 non-null object
Order Date          178438 non-null object
Purchase Address    178438 non-null object
dtypes: object(6)
memory usage: 9.5+ MB

In [12]:
year_sales.describe().T

,count,unique,top,freq
Order ID,178438,178438,234280,1
Product,178438,20,Lightning Charging Cable,20252
Quantity Ordered,178438,10,1,161609
Price Each,178438,24,14.95,20252
Order Date,178438,142396,12/11/19 13:24,7
Purchase Address,178438,140788,"279 Sunset St, San Francisco, CA 94016",7

In [13]:
year_sales.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [14]:
year_sales.rename(columns = {"Price Each": "Unit Price"}, inplace = True)

In [15]:
year_sales[year_sales.Product == "Product"]

,Order ID,Product,Quantity Ordered,Unit Price,Order Date,Purchase Address
1073,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

In [16]:
idx = year_sales[year_sales.Product == "Product"].index

In [17]:
year_sales = year_sales.drop(idx)

In [18]:
year_sales["Product"].value_counts()

Lightning Charging Cable      20251
AAA Batteries (4-pack)        20221
AA Batteries (4-pack)         20204
USB-C Charging Cable          20173
Wired Headphones              17560
Apple Airpods Headphones      14909
Bose SoundSport Headphones    12767
27in FHD Monitor               7351
iPhone                         6722
27in 4K Gaming Monitor         6104
34in Ultrawide Monitor         6056
Google Phone                   5415
Flatscreen TV                  4701
Macbook Pro Laptop             4623
ThinkPad Laptop                4035
20in Monitor                   4022
Vareebadd Phone                2027
LG Washing Machine              653
LG Dryer                        633
Name: Product, dtype: int64

In [19]:
year_sales["Quantity Ordered"] = year_sales["Quantity Ordered"].astype(int)
year_sales["Order ID"] = year_sales["Order ID"].astype(int)
year_sales["Unit Price"] = year_sales["Unit Price"].astype(float)
year_sales.describe().T

,count,mean,std,min,25%,50%,75%,max
Order ID,178427.0,230452.202929,51510.793683,141234.00,185842.50,230452.00,275061.5,319670.0
Quantity Ordered,178427.0,1.125603,0.445210,1.00,1.00,1.00,1.0,9.0
Unit Price,178427.0,187.601456,335.299484,2.99,11.95,14.95,150.0,1700.0

In [20]:
year_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 178427 entries, 0 to 25116
Data columns (total 6 columns):
Order ID            178427 non-null int32
Product             178427 non-null object
Quantity Ordered    178427 non-null int32
Unit Price          178427 non-null float64
Order Date          178427 non-null object
Purchase Address    178427 non-null object
dtypes: float64(1), int32(2), object(3)
memory usage: 8.2+ MB

In [21]:
year_sales.to_csv('../amazon_sales/Amazon_Sales_2019.csv')